---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin
source: html/e27d5116-423b-8b9c-3413-338d77c7772e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin Property

"Parallel Treads at Start": Number of straight steps at the begin of winder

## Syntax (C#)
```csharp
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get; }
```